; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=3, waypoints=8, cameras=3, objectives=7, out_folder=training/easy, instance_id=66, seed=101

(define (problem rover-66)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 - objective)
 (:init 
    (at_lander general waypoint4)
    (at rover1 waypoint6)
    (at rover2 waypoint8)
    (at rover3 waypoint1)
    (equipped_for_soil_analysis rover2)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover3)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover1)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint6)
    (at_soil_sample waypoint1)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (visible waypoint8 waypoint4)
    (visible waypoint7 waypoint1)
    (visible waypoint6 waypoint5)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint8)
    (visible waypoint3 waypoint1)
    (visible waypoint5 waypoint1)
    (visible waypoint1 waypoint7)
    (visible waypoint5 waypoint6)
    (visible waypoint4 waypoint8)
    (visible waypoint2 waypoint5)
    (visible waypoint1 waypoint3)
    (visible waypoint8 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint2 waypoint8)
    (visible waypoint8 waypoint2)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint5 waypoint7)
    (visible waypoint7 waypoint5)
    (visible waypoint2 waypoint7)
    (visible waypoint7 waypoint2)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint4)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint7 waypoint8)
    (visible waypoint8 waypoint7)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint6 waypoint8)
    (visible waypoint8 waypoint6)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (visible waypoint1 waypoint8)
    (visible waypoint8 waypoint1)
    (visible waypoint2 waypoint6)
    (visible waypoint6 waypoint2)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (can_traverse rover1 waypoint8 waypoint4)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint1 waypoint5)
    (can_traverse rover1 waypoint5 waypoint8)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint5 waypoint1)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint4 waypoint8)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint8 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover2 waypoint8 waypoint4)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint5 waypoint8)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint5 waypoint1)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint4 waypoint8)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint8 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint6 waypoint8)
    (can_traverse rover2 waypoint8 waypoint6)
    (can_traverse rover2 waypoint4 waypoint5)
    (can_traverse rover2 waypoint5 waypoint4)
    (can_traverse rover3 waypoint8 waypoint4)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint1 waypoint5)
    (can_traverse rover3 waypoint5 waypoint8)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint5 waypoint1)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint4 waypoint8)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint8 waypoint5)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint7 waypoint2)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint3 waypoint7)
    (can_traverse rover3 waypoint7 waypoint3)
    (can_traverse rover3 waypoint3 waypoint6)
    (can_traverse rover3 waypoint6 waypoint3)
    (can_traverse rover3 waypoint1 waypoint8)
    (can_traverse rover3 waypoint8 waypoint1)
    (calibration_target camera1 objective1)
    (on_board camera1 rover3)
    (supports camera1 low_res)
    (supports camera1 high_res)
    (calibration_target camera2 objective6)
    (on_board camera2 rover1)
    (supports camera2 colour)
    (supports camera2 high_res)
    (calibration_target camera3 objective1)
    (on_board camera3 rover1)
    (supports camera3 colour)
    (supports camera3 low_res)
    (supports camera3 high_res)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint2)
    (visible_from objective3 waypoint5)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint6)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint8)
    (visible_from objective4 waypoint6)
    (visible_from objective5 waypoint7)
    (visible_from objective6 waypoint5)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint1))
 (:goal  (and 
    (communicated_rock_data waypoint5)
    (communicated_rock_data waypoint4)
    (communicated_rock_data waypoint6)
    (communicated_soil_data waypoint4)
    (communicated_soil_data waypoint8)
    (communicated_soil_data waypoint7)
    (communicated_soil_data waypoint1)
    (communicated_image_data objective5 colour)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective3 low_res)
    (communicated_image_data objective4 colour)
    (communicated_image_data objective7 colour)
    (communicated_image_data objective7 low_res)
    (communicated_image_data objective5 high_res)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective2 colour)
    (communicated_image_data objective1 colour)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective1 high_res)
    (communicated_image_data objective3 colour)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective1 low_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective5 low_res))))

; plan
1. (navigate rover2 waypoint8 waypoint4)
   deleted: (at rover2 waypoint8)
   added: (at rover2 waypoint4)
   goals met: 0 of 27
2. (sample_soil rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_soil_sample waypoint4)
   added: (full rover2store) (have_soil_analysis rover2 waypoint4)
   goals met: 0 of 27
3. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 0 of 27
4. (navigate rover2 waypoint4 waypoint2)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint2)
   goals met: 0 of 27
5. (communicate_soil_data rover2 general waypoint4 waypoint2 waypoint4)
   added: (communicated_soil_data waypoint4)
   goals met: 1 of 27
6. (navigate rover2 waypoint2 waypoint4)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint4)
   goals met: 1 of 27
7. (navigate rover2 waypoint4 waypoint8)
   deleted: (at rover2 waypoint4)
   added: (at rover2 waypoint8)
   goals met: 1 of 27
8. (sample_soil rover2 rover2store waypoint8)
   deleted: (empty rover2store) (at_soil_sample waypoint8)
   added: (full rover2store) (have_soil_analysis rover2 waypoint8)
   goals met: 1 of 27
9. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 1 of 27
10. (communicate_soil_data rover2 general waypoint8 waypoint8 waypoint4)
   added: (communicated_soil_data waypoint8)
   goals met: 2 of 27
11. (navigate rover2 waypoint8 waypoint5)
   deleted: (at rover2 waypoint8)
   added: (at rover2 waypoint5)
   goals met: 2 of 27
12. (navigate rover2 waypoint5 waypoint7)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint7)
   goals met: 2 of 27
13. (sample_soil rover2 rover2store waypoint7)
   deleted: (empty rover2store) (at_soil_sample waypoint7)
   added: (full rover2store) (have_soil_analysis rover2 waypoint7)
   goals met: 2 of 27
14. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 2 of 27
15. (communicate_soil_data rover2 general waypoint7 waypoint7 waypoint4)
   added: (communicated_soil_data waypoint7)
   goals met: 3 of 27
16. (navigate rover2 waypoint7 waypoint1)
   deleted: (at rover2 waypoint7)
   added: (at rover2 waypoint1)
   goals met: 3 of 27
17. (sample_soil rover2 rover2store waypoint1)
   deleted: (empty rover2store) (at_soil_sample waypoint1)
   added: (full rover2store) (have_soil_analysis rover2 waypoint1)
   goals met: 3 of 27
18. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 3 of 27
19. (communicate_soil_data rover2 general waypoint1 waypoint1 waypoint4)
   added: (communicated_soil_data waypoint1)
   goals met: 4 of 27
20. (navigate rover3 waypoint1 waypoint5)
   deleted: (at rover3 waypoint1)
   added: (at rover3 waypoint5)
   goals met: 4 of 27
21. (sample_rock rover3 rover3store waypoint5)
   deleted: (empty rover3store) (at_rock_sample waypoint5)
   added: (full rover3store) (have_rock_analysis rover3 waypoint5)
   goals met: 4 of 27
22. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 4 of 27
23. (communicate_rock_data rover3 general waypoint5 waypoint5 waypoint4)
   added: (communicated_rock_data waypoint5)
   goals met: 5 of 27
24. (navigate rover3 waypoint5 waypoint2)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint2)
   goals met: 5 of 27
25. (navigate rover3 waypoint2 waypoint4)
   deleted: (at rover3 waypoint2)
   added: (at rover3 waypoint4)
   goals met: 5 of 27
26. (sample_rock rover3 rover3store waypoint4)
   deleted: (empty rover3store) (at_rock_sample waypoint4)
   added: (full rover3store) (have_rock_analysis rover3 waypoint4)
   goals met: 5 of 27
27. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 5 of 27
28. (navigate rover3 waypoint4 waypoint2)
   deleted: (at rover3 waypoint4)
   added: (at rover3 waypoint2)
   goals met: 5 of 27
29. (communicate_rock_data rover3 general waypoint4 waypoint2 waypoint4)
   added: (communicated_rock_data waypoint4)
   goals met: 6 of 27
30. (navigate rover3 waypoint2 waypoint5)
   deleted: (at rover3 waypoint2)
   added: (at rover3 waypoint5)
   goals met: 6 of 27
31. (navigate rover3 waypoint5 waypoint6)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint6)
   goals met: 6 of 27
32. (sample_rock rover3 rover3store waypoint6)
   deleted: (empty rover3store) (at_rock_sample waypoint6)
   added: (full rover3store) (have_rock_analysis rover3 waypoint6)
   goals met: 6 of 27
33. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 6 of 27
34. (communicate_rock_data rover3 general waypoint6 waypoint6 waypoint4)
   added: (communicated_rock_data waypoint6)
   goals met: 7 of 27
35. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 7 of 27
36. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 7 of 27
37. (navigate rover1 waypoint5 waypoint1)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint1)
   goals met: 7 of 27
38. (navigate rover1 waypoint1 waypoint7)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint7)
   goals met: 7 of 27
39. (take_image rover1 waypoint7 objective5 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective5 colour)
   goals met: 7 of 27
40. (communicate_image_data rover1 general objective5 colour waypoint7 waypoint4)
   added: (communicated_image_data objective5 colour)
   goals met: 8 of 27
41. (navigate rover1 waypoint7 waypoint1)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint1)
   goals met: 8 of 27
42. (navigate rover1 waypoint1 waypoint5)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint5)
   goals met: 8 of 27
43. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 8 of 27
44. (take_image rover1 waypoint5 objective6 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective6 low_res)
   goals met: 8 of 27
45. (communicate_image_data rover1 general objective6 low_res waypoint5 waypoint4)
   added: (communicated_image_data objective6 low_res)
   goals met: 9 of 27
46. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 9 of 27
47. (take_image rover1 waypoint5 objective3 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 low_res)
   goals met: 9 of 27
48. (communicate_image_data rover1 general objective3 low_res waypoint5 waypoint4)
   added: (communicated_image_data objective3 low_res)
   goals met: 10 of 27
49. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 10 of 27
50. (take_image rover1 waypoint5 objective4 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 colour)
   goals met: 10 of 27
51. (communicate_image_data rover1 general objective4 colour waypoint5 waypoint4)
   added: (communicated_image_data objective4 colour)
   goals met: 11 of 27
52. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 11 of 27
53. (navigate rover1 waypoint5 waypoint1)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint1)
   goals met: 11 of 27
54. (take_image rover1 waypoint1 objective7 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective7 colour)
   goals met: 11 of 27
55. (communicate_image_data rover1 general objective7 colour waypoint1 waypoint4)
   added: (communicated_image_data objective7 colour)
   goals met: 12 of 27
56. (navigate rover1 waypoint1 waypoint5)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint5)
   goals met: 12 of 27
57. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 12 of 27
58. (navigate rover1 waypoint5 waypoint1)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint1)
   goals met: 12 of 27
59. (take_image rover1 waypoint1 objective7 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective7 low_res)
   goals met: 12 of 27
60. (communicate_image_data rover1 general objective7 low_res waypoint1 waypoint4)
   added: (communicated_image_data objective7 low_res)
   goals met: 13 of 27
61. (navigate rover1 waypoint1 waypoint5)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint5)
   goals met: 13 of 27
62. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 13 of 27
63. (navigate rover1 waypoint5 waypoint1)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint1)
   goals met: 13 of 27
64. (navigate rover1 waypoint1 waypoint7)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint7)
   goals met: 13 of 27
65. (take_image rover1 waypoint7 objective5 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective5 high_res)
   goals met: 13 of 27
66. (communicate_image_data rover1 general objective5 high_res waypoint7 waypoint4)
   added: (communicated_image_data objective5 high_res)
   goals met: 14 of 27
67. (navigate rover1 waypoint7 waypoint1)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint1)
   goals met: 14 of 27
68. (navigate rover1 waypoint1 waypoint5)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint5)
   goals met: 14 of 27
69. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 14 of 27
70. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 14 of 27
71. (take_image rover1 waypoint2 objective2 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 14 of 27
72. (communicate_image_data rover1 general objective2 low_res waypoint2 waypoint4)
   added: (communicated_image_data objective2 low_res)
   goals met: 15 of 27
73. (calibrate rover1 camera3 objective1 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 15 of 27
74. (take_image rover1 waypoint2 objective2 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 colour)
   goals met: 15 of 27
75. (communicate_image_data rover1 general objective2 colour waypoint2 waypoint4)
   added: (communicated_image_data objective2 colour)
   goals met: 16 of 27
76. (calibrate rover1 camera3 objective1 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 16 of 27
77. (take_image rover1 waypoint2 objective1 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 16 of 27
78. (communicate_image_data rover1 general objective1 colour waypoint2 waypoint4)
   added: (communicated_image_data objective1 colour)
   goals met: 17 of 27
79. (calibrate rover1 camera3 objective1 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 17 of 27
80. (navigate rover1 waypoint2 waypoint5)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint5)
   goals met: 17 of 27
81. (take_image rover1 waypoint5 objective6 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective6 colour)
   goals met: 17 of 27
82. (communicate_image_data rover1 general objective6 colour waypoint5 waypoint4)
   added: (communicated_image_data objective6 colour)
   goals met: 18 of 27
83. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 18 of 27
84. (take_image rover1 waypoint5 objective1 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 high_res)
   goals met: 18 of 27
85. (communicate_image_data rover1 general objective1 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective1 high_res)
   goals met: 19 of 27
86. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 19 of 27
87. (take_image rover1 waypoint5 objective3 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 colour)
   goals met: 19 of 27
88. (communicate_image_data rover1 general objective3 colour waypoint5 waypoint4)
   added: (communicated_image_data objective3 colour)
   goals met: 20 of 27
89. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 20 of 27
90. (take_image rover1 waypoint5 objective4 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 low_res)
   goals met: 20 of 27
91. (communicate_image_data rover1 general objective4 low_res waypoint5 waypoint4)
   added: (communicated_image_data objective4 low_res)
   goals met: 21 of 27
92. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 21 of 27
93. (take_image rover1 waypoint5 objective3 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 high_res)
   goals met: 21 of 27
94. (communicate_image_data rover1 general objective3 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective3 high_res)
   goals met: 22 of 27
95. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 22 of 27
96. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 22 of 27
97. (take_image rover1 waypoint2 objective2 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 high_res)
   goals met: 22 of 27
98. (communicate_image_data rover1 general objective2 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective2 high_res)
   goals met: 23 of 27
99. (calibrate rover1 camera3 objective1 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 23 of 27
100. (take_image rover1 waypoint2 objective1 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 23 of 27
101. (communicate_image_data rover1 general objective1 low_res waypoint2 waypoint4)
   added: (communicated_image_data objective1 low_res)
   goals met: 24 of 27
102. (calibrate rover1 camera3 objective1 waypoint2)
   added: (calibrated camera3 rover1)
   goals met: 24 of 27
103. (navigate rover1 waypoint2 waypoint5)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint5)
   goals met: 24 of 27
104. (take_image rover1 waypoint5 objective6 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective6 high_res)
   goals met: 24 of 27
105. (communicate_image_data rover1 general objective6 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective6 high_res)
   goals met: 25 of 27
106. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 25 of 27
107. (take_image rover1 waypoint5 objective4 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 high_res)
   goals met: 25 of 27
108. (communicate_image_data rover1 general objective4 high_res waypoint5 waypoint4)
   added: (communicated_image_data objective4 high_res)
   goals met: 26 of 27
109. (calibrate rover1 camera3 objective1 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 26 of 27
110. (navigate rover1 waypoint5 waypoint1)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint1)
   goals met: 26 of 27
111. (navigate rover1 waypoint1 waypoint7)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint7)
   goals met: 26 of 27
112. (take_image rover1 waypoint7 objective5 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective5 low_res)
   goals met: 26 of 27
113. (communicate_image_data rover1 general objective5 low_res waypoint7 waypoint4)
   added: (communicated_image_data objective5 low_res)
   goals met: 27 of 27
